{

"lobby": {
	"type" : "room",
    "name" : "the game lobby",
	"exits": {
		"south": "town square"
	},
	"entrance text": "You are in the first room of the new, data-driven world we are creating in an attempt to be a halfway intelligent human."

},


"town square": {
    "type" : "room",
	"name" : "the town square",

	"look" : "The town square, full of people and activities.",

	"exits": {
		"north" : "cider brewery front",
		"south" : "drury lane front",
		"west"  : "donutorium front"
	},

	"entrance text": "You are in the Delran town square, which is bustling with activity. It's autumn, and the weekends are always like this -- people traveling to the blacksmith or the cobbler's, or rushing over to the dairy to try to get the last of the week's butter. The sun is out, there are leaves on the ground, and all seems well.",

    "visits" : 0

    
},


"cider brewery front": {
	"type" : "room",

    "name" : "the front of the cider brewery",

	"look" : "The best damn apple cider plant in the land.",
	
	"exits": {
		"south" : "town square",
		"north" : "cider brewery"
	},	
	
	"entrance text": "The cider brewery, housed in what used to be the biggest barn in town. Now significantly larger (and noisier), but you can still see where the original building was worked into the larger design.",

    "visits" : 0

},


"cider brewery": {
    "type" : "room",
	"name" : "the cider brewery",

	"look": "The front door of the Cider Brewery. Predictably, everything here smells like apples.",

	"exits": {
		"south" : "cider brewery front"
	},

	"entrance text": "The old Delran Cider Brewery, the second-largest culinary outfit in town. You can hear the workers yelling apple-related things at each other just behind a large door. A young man sits at a desk in the lobby.",

    "visits" : 0,

    "actions" : {
        "talk" : {
            "man" : {"menu" : "cider"}
        }
    }
},


"drury lane front": {
    "type" : "room",

	"name" : "the entrance to Drury Lane",

	"look" : "The entrance to quaint, quiet Drury Lane, actually a court because it doesn't go anywhere. Trees line the streets, in between gaslamps along thin sidewalks.",

	"exits" : {
		"north" : "town square",
		"south" : "drury lane"
	},

	"entrance text": "You turn and walk down Drury Lane, the street on which you grew up. It's one of the few streets in town without wagon ruts worn in the middle, as most of the other streets have a mix of businesses and homes. Drury, however, has only a few houses, to the south.",

    "visits" : 0


},


"drury lane": {
    "type" : "room",

	"name" : "Drury Lane",

	"look" : "Drury Lane, the same old street you grew up on. As a kid, you were bored out of your mind on this dead-end, but now you can appreciate its peaceful atmosphere and unassuming construction.",

	"exits" : {
		"north" : "drury lane front",
        "south" : "parents house front"
	},

	"entrance text" : "You're on Drury Lane.",

    "visits" : 0

},


"donutorium front": {
    "type" : "room",

	"name" : "the front of the Donutorium",
	
	"look" : "The gates of the town donutorium, the most famous donut factory in all the land.",

	"exits": {
		"west" : "donutorium",
		"east" : "town square"
	},

	"entrance text": "You are at the front gates of the illustrious Delran Donutorium. No better donut has ever been made than the one that comes out of this place hundreds of times a day.",

    "visits" : 0


},


"donutorium" : {
    "type" : "room",

	"name" : "the Donutorium",

	"look" : "The front door of the Donutorium, behind the short wooden fence that's clearly there more for decoration than security.",

	"exits" : {
		"east" : "donutorium front"
	},

	"entrance text" : "In the donut factory!",

    "visits" : 0

},

"parents house front" : {
    "type" : "room",

    "name" : "your parents' porch",

    "look" : "The front door of your parent's house -- a small, two-story bungalow with a pointy roof and window boxes full of flowers and herbs.",

    "exits" : {
        "north" : "drury lane",
        "south" : "parents house"
    },

    "entrance text" : "You are on your parents' porch.",

    "visits" : 0,

    "items" : {
        "pumpkin" : {
            "status" : "default",
            "states" : {
                "default" : {
                    "descriptor" : "A large pumpkin sits by the door."
                },
                "take" : {
                    "descriptor" : "",
                    "from" : {"default" : "You take the pumpkin."}
                },
                "smash" : {
                    "descriptor" : "The gloppy remains of a smashed-up old pumpkin sit by the door.",
                    "from" : {"default" : "You lift the pumpkin high over your head and slam it back down on the porch. It crumbles into little pumpkin chunklets."}
                }
            }
        }
    }
},

"parents house" : {
    "type" : "room",
    
    "name" : "your parents' house",

    "look" : "You can't see through the door, but can hear someone bustling around inside.",

    "exits" : {
        "north" : "parents house front"
    },

    "entrance text" : "You walk through the door and into your childhood home, almost totally unchanged. It's cleaner now that there aren't kids running around banging on everything, but the decorations are safe and familiar.",

    "visits" : 0,

    "items" : {
        "cookie" : {
            "status" : "default",
            "states" : {
                "default" : {
                    "descriptor" : "Your mom hugs you tightly. \n\t\"Welcome home, dear,\" she says. \"Have a cookie!\""
                },
                "take" : {
                    "descriptor" : "Your mom is bustling around the house, doing random spring cleaning.",
                    "from" : {"default" : "You take the cookie and put it in your pack. \n\t\"Thanks, Mom,\" you say, \"I'm sure this will come in handy soon.\""}
                }
            }
        }
    }
}

}
